<?php
	//Функция подключения к БД kit_kal
	function connect_db() {
		$mysqli_function = new mysqli(
							"localhost",
							"******",
							"******",
							"kit_kal"
							);
		return $mysqli_function;
	}
	//Функция для создания строки в таблице date в БД kit_kal
	function createDb($id, $dateg,$h_stems, $color, $animal){
		$mysqli = connect_db();
		$mysqli->query("INSERT INTO date 
						(id, dateg, h_stems, color, animal)
						VALUES
						('$id','$dateg', '$h_stems', '$color', '$animal')
						");
		return true;
	}
	/*
	////////////////////////////Заполним базу данных. Запустить один раз//////////////////////////////
	for($i=1;$i<=60;$i++){
//...............................Определяем Небесные Столбы и Цвет...............................................
		$h = "";
		$c = "";
		if($i == 1 || $i == 11 || $i == 21 || $i == 31 || $i == 41 || $i == 51 || 
		   $i == 2 || $i == 12 || $i == 22 || $i == 32 || $i == 42 || $i == 52 ){
			$h = "Дерево";
			$c = "Бирюзовый, зеленый";
		}
		if($i == 3 || $i == 13 || $i == 23 || $i == 33 || $i == 43 || $i == 53 || 
		   $i == 4 || $i == 14 || $i == 24 || $i == 34 || $i == 44 || $i == 54 ){
			$h = "Огонь";
			$c = "Красный";
		}
		if($i == 5 || $i == 15 || $i == 25 || $i == 35 || $i == 45 || $i == 55 || 
		   $i == 6 || $i == 16 || $i == 26 || $i == 36 || $i == 46 || $i == 56 ){
			$h = "Желтый";
			$c = "Бирюзовый, зеленый";
		}
		if($i == 7 || $i == 17 || $i == 27 || $i == 37 || $i == 47 || $i == 57 || 
		   $i == 8 || $i == 18 || $i == 28 || $i == 38 || $i == 48 || $i == 58 ){
			$h = "Белый";
			$c = "Бирюзовый, зеленый";
		}
		if($i == 9 || $i == 19 || $i == 29 || $i == 39 || $i == 49 || $i == 59 || 
		  $i == 10 || $i == 20 || $i == 30 || $i == 40 || $i == 50 || $i == 60 ){
			$h = "Вода";
			$c = "Черный, синий";
		}
//..................................Определяем Китайский Зодиак................................................		
		$a = "";
		if ($i == 1 || $i == 13 || $i == 25 || $i == 37 || $i == 49 ){
			$a = "Крыса";
		}
		if ($i == 2 || $i == 14 || $i == 26 || $i == 38 || $i == 50 ){
			$a = "Бык";
		}
		if ($i == 3 || $i == 15 || $i == 27 || $i == 39 || $i == 51 ){
			$a = "Тигр";
		}
		if ($i == 4 || $i == 16 || $i == 28 || $i == 40 || $i == 52 ){
			$a = "Кролик";
		}
		if ($i == 5 || $i == 15 || $i == 29 || $i == 41 || $i == 53 ){
			$a = "Дракон";
		}
		if ($i == 6 || $i == 18 || $i == 30 || $i == 42 || $i == 54 ){
			$a = "Змея";
		}
		if ($i == 7 || $i == 19 || $i == 31 || $i == 43 || $i == 55 ){
			$a = "Лошадь";
		}
		if ($i == 8 || $i == 20 || $i == 32 || $i == 44 || $i == 56 ){
			$a = "Овца";
		}
		if ($i == 9 || $i == 21 || $i == 33 || $i == 45 || $i == 57 ){
			$a = "Обезъяна";
		}
		if ($i == 10 || $i == 22 || $i == 34 || $i == 46 || $i == 58 ){
			$a = "Петух";
		}
		if ($i == 11 || $i == 23 || $i == 35 || $i == 47 || $i == 59 ){
			$a = "Собака";
		}
		if ($i == 12 || $i == 24 || $i == 36 || $i == 48 || $i == 60 ){
			$a = "Свинья";
		}
		
		createDb($i, ($i+1923), $h, $c, $a);
		createDb(($i+60), ($i+1983), $h, $c, $a);
	}
	*/
	/////////////////////////////////Если база данных заполнилась, конетируем блок for///////////////////////////
	
	
?>
	<!--Форма-->
	
	<h1>Введите год по грегорианскому клендарю(1924 - 2043):</h1>
<form method="post" align="center">
	<p>Год: <input type="text" name="year" /></p>
	<p><input type="submit" name="to-kit-kal" value="Узнать" /></p>
</form>
<?php
	function showYear($year){
		$mysqli = connect_db();
		$result = $mysqli->query("
							SELECT dateg, h_stems, color, animal  
							FROM date
							WHERE dateg = '$year'");
		$rows = $result->fetch_assoc();
			
			echo "По китайскому календарю ".$rows['dateg']. "году соответствует<br /> 
			Небесный Столб: ".$rows['h_stems'].";<br /> 
			Цвет: ".$rows['color'].";<br />
			Ветвь Земли: ".$rows['animal'];
	}
	
	if(isset($_POST['year'])){
		$year = abs((int)$_POST['year']);
		if($year>=1924 && $year<=2043){
			showYear($year);
		}else{
			echo "Год не соответсвует заданному диапозону (1924 - 2043)";
		}
	}
?>

